#  一个合法的身份证号码由17位地区、日期编号和顺序编号加1位校验码组成。中国居民身份证校验码算法如下：
# 1.将身份证号码前面的17位数分别乘以不同的系数。
# 从第一位到第十七位的系数分别为：7－9－10－5－8－4－2－1－6－3－7－9－10－5－8－4－2。
# 2.将这17位数字和系数相乘的结果相加。用加出来和除以11，取余数。
# 3.余数只可能有0－1－2－3－4－5－6－7－8－9－10这11个数字， 
# 其分别对应的最后一位身份证的号码为1－0－X－9－8－7－6－5－4－3－2。
# 余数和校验码的对应关系可以用公式：m=(12-n) mod 11计算，其中mod为求余运算，m为校验码，n为之前计算出来的余数。
# 如果之前计算出的余数是3，第18位的校验码就是9。如果余数是2那么对应的校验码就是X，X实际是罗马数字10。 
# 编写程序，判断一个身份证的最后一位校验码是否正确，这里并不检验前17位是否合理

a = input()
if len(a) != 18:
    print("Error")
else:
    b = int(a[0])
    c = int(a[1])
    d = int(a[2])
    e = int(a[3])
    f = int(a[4])
    g = int(a[5])
    h = int(a[6])
    i = int(a[7])
    j = int(a[8])
    k = int(a[9])
    l = int(a[10])
    m = int(a[11])
    n = int(a[12])
    o = int(a[13])
    p = int(a[14])
    q = int(a[15])
    r = int(a[16])
    b1 = b*7
    c1 = c*9
    d1 = d*10
    e1 = e*5
    f1 = f*8
    g1 = g*4
    h1 = h*2
    i1 = i*1
    j1 = j*6
    k1 = k*3
    l1 = l*7
    m1 = m*9
    n1 = n*10
    o1 = o*5
    p1 = p*8
    q1 = q*4
    r1 = r*2
    a1 = b1+c1+d1+e1+f1+g1+h1+i1+j1+k1+l1+m1+n1+o1+p1+q1+r1
    s = a1%11
    t = (12-s)%11
    if t == 10:
        t = "X"
    else:
        t = t
    if str(t) == str(a[17]):
        print('Correct')
    else:
        print('Wrong')

